Revit 2024 API
BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnSwitchBoard Property
 Need to replace spare or space on switchboard.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ReplaceSpareSpaceOnSwitchBoard { get; }
Visual Basic
Public Shared ReadOnly Property ReplaceSpareSpaceOnSwitchBoard As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ReplaceSpareSpaceOnSwitchBoard {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace